app/controllers/blog_posts_controller.rb

  def index

    @blog_posts = BlogPost.all
---
SELECT * FROM `blog_posts`

  def create
    @blog_post = BlogPost.new(params[:blog_post])
    if @blog_post.save!
---
INSERT INTO `blog_posts` (`created_at`, `title`, `body`, `editor_id`, `updated_at`, `author_id`, `comment_id`) VALUES('2010-11-26 06:46:43', 'Non sports', 'Non sports', NULL, '2010-11-26 06:46:43', NULL, NULL)

  def show

    @blog_post = BlogPost.find(params[:id])
---
SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)

  def update
    @blog_post = BlogPost.find(params[:id])
    if @blog_post.update_attributes!(params[:blog_post])
---
SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 3)
UPDATE `blog_posts` SET `updated_at` = '2010-11-29 06:19:31', `body` = 'Switzerland has approved a plan to automatically deport foreigners convicted of serious crimes. The proposal, put forth by the nationalist Swiss People’s Party, has been criticized by human rights groups.\r\n\r\nSwiss voters have approved a far-right initiative to automatically expel foreign residents convicted of serious crimes, according to poll results.\r\n\r\nSwiss national broadcaster SF1 said 52.9 percent of voters backed the initiative in Sunday’s referendum, a plan proposed by the nationalist Swiss People’s Party (SVP).\r\n\r\nA counter-proposal put forth by the Swiss government, which would make expulsion dependent on the length of a prison term rather on an arbitrary list of offenses, appears to have been rejected by most voters, according to preliminary results. Currently, decisions to expel foreigners convicted of serious crimes are made on a case-by-case basis.\r\n\r\nThe initiative, which would apply to foreigners convicted of crimes like murder, rape or trafficking in drugs or people, has been criticized by human rights groups and legal experts, who said it could disregard international anti-discrimination treaties and the free movement of peoples under European Union law.\r\n\r\nForeigners make up more than a fifth of Switzerland’s population of 7.7 million, and according to official figures are disproportionately charged with crimes.\r\n' WHERE `id` = 7

  def edit
    #TODO: Get information as to how the fields from the database tables are populated when in edit mode
    @blog_post = BlogPost.find(params[:id])
---
SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)