app/controllers/categories_controller.rb

  def show
    @records = Category.find(params[:id]).blog_posts
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)