app/controllers/comments_controller.rb

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
---
  def new
    @blog_post=BlogPost.find(params[:blog_post_id])

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.blog_post_id = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `comments` (`created_at`, `updated_at`, `user_id`, `content`, `blog_post_id`) VALUES('2010-11-24 12:15:37', '2010-11-24 12:15:37', NULL, '', 1)
UPDATE `comments` SET `updated_at` = '2010-11-25 12:33:17', `user_id` = 1 WHERE `id` = 66
---
  def create
    #TODO: make the user_id not to be null, after creation of users and authentication
    @record = BlogPost.find(params[:blog_post_id])
    @comment = @record.comments.new(:content=>params[:content])
    @comment.user=User.find(params[:user_id])
    if(@comment.save!)