app/controllers/sessions_controller.rb

  def create
    @user = User.find_by_username(params[:username])
---
SELECT * FROM `users` WHERE (`users`.`username` = 'porsamini') LIMIT 1