app/controllers/test1s_controller.rb

SELECT * FROM `test1s`
---
  def index
    @test1s = Test1.all

SELECT * FROM `test1s` WHERE (`test1s`.`id` = 980190962)
---
  def show
    @test1 = Test1.find(params[:id])

SELECT * FROM `test1s` WHERE (`test1s`.`id` = 980190962)
---
  def edit
    @test1 = Test1.find(params[:id])

INSERT INTO `test1s` (`name`, `updated_at`, `age`, `location`, `created_at`) VALUES(NULL, '2010-10-03 18:16:23', NULL, NULL, '2010-10-03 18:16:23')
---
  def create
    @test1 = Test1.new(params[:test1])

    respond_to do |format|
      if @test1.save

SELECT * FROM `test1s` WHERE (`test1s`.`id` = 980190962)
---
  def update
    @test1 = Test1.find(params[:id])

SELECT * FROM `test1s` WHERE (`test1s`.`id` = 980190962)
DELETE FROM `test1s` WHERE `id` = 980190962
---
  def destroy
    @test1 = Test1.find(params[:id])
    @test1.destroy