app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`is_admin` = 1)
UPDATE `users` SET updated_at='2010-11-26 16:26:54',is_admin=0 WHERE (`users`.`id` IS NULL)
---
  def update_admin_privilege
     old_admin_users=User.find_all_by_is_admin(true).collect(&:id)
     if new_admin_users=params[:user_ids]
      unchecked_admin_users = old_admin_users - new_admin_users
     end
     User.update_all(["updated_at=?,is_admin=?",Time.now,false], :id=>unchecked_admin_users)